manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
uint32_t nowSeconds()
{
    return sys::epoch_seconds_now();
}

::chat::runtime::MeshtasticPositionInput buildSelfPositionInput()
{
    const platform::ui::gps::GpsState gps_state = platform::ui::gps::get_data();

    ::chat::runtime::MeshtasticPositionInput input{};
    input.valid = gps_state.valid;
    input.latitude_deg = gps_state.lat;
    input.longitude_deg = gps_state.lng;
    input.has_altitude = gps_state.has_alt;
    input.altitude_m = gps_state.alt_m;
    input.has_speed = gps_state.has_speed;
    input.speed_mps = gps_state.speed_mps;
    input.has_course = gps_state.has_course;
    input.course_deg = gps_state.course_deg;
    input.satellites = gps_state.satellites;
    input.timestamp_s = nowSeconds();
    return input;
}

} // namespace

MeshtasticRadioAdapter::MeshtasticRadioAdapter(const ::chat::runtime::SelfIdentityProvider* identity_provider,
                                               NodeStore* node_store,
                                               ::chat::contacts::ContactService* contact_service)
    : node_id_(device_identity::getSelfNodeId()),
      identity_provider_(identity_provider),
      node_store_(node_store),
      contact_service_(contact_service)
{
    randomSeed(static_cast<unsigned long>(NRF_FICR->DEVICEADDR[0] ^ NRF_FICR->DEVICEADDR[1] ^ micros()));
    next_packet_id_ = static_cast<::chat::MessageId>(random(1, 0x7FFFFFFF));
    pki_ready_ = initPkiKeys();
    loadPkiNodeKeys();
}

::chat::MeshCapabilities MeshtasticRadioAdapter::getCapabilities() const
{
    ::chat::MeshCapabilities caps{};
    caps.supports_unicast_text = true;
    caps.supports_unicast_appdata = true;
    caps.supports_broadcast_appdata = true;
    caps.supports_appdata_ack = true;
    caps.provides_appdata_sender = true;
    caps.supports_node_info = true;
    caps.supports_pki = true;
    caps.supports_node_info_query = true;
    caps.supports_node_info_reply = true;
    caps.supports_node_info_reannounce = true;
    caps.supports_position_request = true;
    caps.supports_position_reply = true;
    caps.supports_trace_route_request = true;
    caps.supports_trace_route_reply = true;
    caps.supports_protocol_app_response = true;
    caps.supports_protocol_ack_tracking = true;
    return caps;
}

bool MeshtasticRadioAdapter::sendText(::chat::ChannelId channel, const std::string& text,
                                      ::chat::MessageId* out_msg_id, ::chat::NodeId peer)
{
    return sendTextWithId(channel, text, 0, out_msg_id, peer);
}

bool MeshtasticRadioAdapter::sendTextWithId(::chat::ChannelId channel, const std::string& text,
                                            ::chat::MessageId forced_msg_id,
                                            ::chat::MessageId* out_msg_id, ::chat::NodeId peer)
{
    if (!isReady() || text.empty() || !config_.tx_enabled)
    {
        return false;
    }

    ::chat::ChannelId out_channel = channel;
    if (encrypt_mode_ == 0 || encrypt_mode_ == 2)
    {
        out_channel = ::chat::ChannelId::PRIMARY;
    }

    if (shouldRequireDirectPki(encrypt_mode_,
                               (peer == 0) ? kBroadcastNode : peer,
                               meshtastic_PortNum_TEXT_MESSAGE_APP))
    {
        const ::chat::MessageId packet_id = (forced_msg_id != 0) ? forced_msg_id : next_packet_id_;
        const bool ok = sendAppData(out_channel,
                                    meshtastic_PortNum_TEXT_MESSAGE_APP,
                                    reinterpret_cast<const uint8_t*>(text.data()),
                                    text.size(),
                                    peer,
                                    true,
                                    packet_id,
                                    false);
        if (ok && out_msg_id)
        {
            *out_msg_id = packet_id;
        }
        return ok;
    }

    auto& scratch = tx_scratch_;
    std::fill(scratch.app_data.begin(), scratch.app_data.end(), 0);
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);
    uint8_t* payload = scratch.app_data.data();
    size_t payload_size = scratch.app_data.size();
    const ::chat::MessageId packet_id = (forced_msg_id != 0) ? forced_msg_id : next_packet_id_++;
    if (forced_msg_id != 0 && forced_msg_id >= next_packet_id_)
    {
        next_packet_id_ = forced_msg_id + 1;
        if (next_packet_id_ == 0)
        {
            next_packet_id_ = 1;
        }
    }
    const ::chat::NodeId dest = (peer == 0) ? kBroadcastNode : peer;
    if (!::chat::meshtastic::encodeTextMessage(out_channel,
                                               text,
                                               node_id_,
                                               packet_id,
                                               dest,
                                               payload,
                                               &payload_size))
    {
        return false;
    }

    size_t key_len = 0;
    const uint8_t* key = selectKey(config_, out_channel, &key_len);
    const uint8_t channel_hash = ::chat::meshtastic::computeChannelHash(channelNameFor(config_, out_channel),
                                                                        key,
                                                                        key_len);
    const bool track_ack = true;
    const bool air_want_ack = shouldSetAirWantAck(dest, track_ack);

    uint8_t* wire = scratch.wire.data();
    size_t wire_size = scratch.wire.size();
    if (!::chat::meshtastic::buildWirePacket(payload,
                                             payload_size,
                                             node_id_,
                                             packet_id,
                                             dest,
                                             channel_hash,
                                             config_.hop_limit,
                                             air_want_ack,
                                             key,
                                             key_len,
                                             wire,
                                             &wire_size))
    {
        return false;
    }

