manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
        logMeshtasticRx("[gat562][mt] app queued from=%08lX to=%08lX id=%lu port=%u len=%u\n",
                        static_cast<unsigned long>(app_data.from),
                        static_cast<unsigned long>(app_data.to),
                        static_cast<unsigned long>(app_data.packet_id),
                        static_cast<unsigned>(app_data.portnum),
                        static_cast<unsigned>(app_data.payload.size()));

        data_queue_.push(std::move(app_data));
    }
}

void MeshtasticRadioAdapter::setLastRxStats(float rssi, float snr)
{
    last_rx_rssi_ = rssi;
    last_rx_snr_ = snr;
}

void MeshtasticRadioAdapter::processSendQueue()
{
    const uint32_t now_ms = millis();
    maybeBroadcastNodeInfo(now_ms);
    for (auto it = pending_retransmits_.begin(); it != pending_retransmits_.end();)
    {
        auto& pending = it->second;
        if (pending.next_tx_ms > now_ms)
        {
            ++it;
            continue;
        }

        auto* header = reinterpret_cast<::chat::meshtastic::PacketHeaderWire*>(pending.wire.data());
        if (pending.retries_left == 0)
        {
            if (pending.observe_only)
            {
                logMeshtasticRx("[gat562][mt] observe timeout id=%08lX dest=%08lX ch=%u local=%u want_ack=%u\n",
                                static_cast<unsigned long>(pending.packet_id),
                                static_cast<unsigned long>(pending.dest),
                                static_cast<unsigned>(pending.channel),
                                pending.local_origin ? 1U : 0U,
                                pending.want_ack ? 1U : 0U);
            }
            if (pending.local_origin && pending.want_ack)
            {
                emitRoutingResult(pending.packet_id,
                                  meshtastic_Routing_Error_MAX_RETRANSMIT,
                                  node_id_,
                                  pending.dest,
                                  pending.channel,
                                  pending.channel_hash,
                                  nullptr);
            }
            if (node_store_ && pending.dest != 0 && pending.dest != kBroadcastNode)
            {
                node_store_->setNextHop(pending.dest, 0, nowSeconds());
            }
            it = pending_retransmits_.erase(it);
            continue;
        }

        if (pending.observe_only)
        {
            ++it;
            continue;
        }

        if (pending.retries_left == 1 && header->next_hop != 0)
        {
            header->next_hop = 0;
            pending.fallback_sent = true;
            if (node_store_ && pending.dest != 0 && pending.dest != kBroadcastNode)
            {
                node_store_->setNextHop(pending.dest, 0, nowSeconds());
            }
        }

        if (transmitWire(pending.wire.data(), pending.wire.size()))
        {
            rememberLocalPacket(*header);
        }
        pending.retries_left--;
        pending.next_tx_ms = now_ms + kRetransmitIntervalMs;
        ++it;
    }
}

void MeshtasticRadioAdapter::flushDeferredPersistence(bool force)
{
    if (!pki_node_keys_dirty_)
    {
        return;
    }

    const uint32_t now_ms = millis();
    if (!force && static_cast<int32_t>(now_ms - pki_node_keys_save_due_ms_) < 0)
    {
        return;
    }

    if (!savePkiKeysToPrefs())
    {
        pki_node_keys_save_due_ms_ = millis() + kPkiNodeSaveDebounceMs;
    }
}

::chat::runtime::EffectiveSelfIdentity MeshtasticRadioAdapter::buildEffectiveIdentity() const
{
    ::chat::runtime::EffectiveSelfIdentity identity{};

    if (identity_provider_)
    {
        ::chat::runtime::SelfIdentityInput input{};
        if (identity_provider_->readSelfIdentityInput(&input))
        {
            if (!long_name_.empty())
            {
                input.configured_long_name = long_name_.c_str();
            }
            if (!short_name_.empty())
            {
                input.configured_short_name = short_name_.c_str();
            }
            (void)::chat::runtime::resolveEffectiveSelfIdentity(input, &identity);
            return identity;
        }
    }

    ::chat::runtime::SelfIdentityInput input{};
    input.node_id = node_id_;
    input.configured_long_name = long_name_.c_str();
    input.configured_short_name = short_name_.c_str();
    input.fallback_long_prefix = "node";
    input.fallback_ble_prefix = "node";
    input.allow_short_hex_fallback = true;
    (void)::chat::runtime::resolveEffectiveSelfIdentity(input, &identity);
    return identity;
}

bool MeshtasticRadioAdapter::transmitWire(const uint8_t* data, size_t size)
{
    auto* io = ::platform::nrf52::arduino_common::chat::infra::radioPacketIo();
    return io && io->transmit(data, size);
}

bool MeshtasticRadioAdapter::transmitPreparedWire(uint8_t* data, size_t size, ::chat::ChannelId channel,
                                                  const meshtastic_Data* decoded, bool track_retransmit,
                                                  bool local_origin, uint8_t retries_override,
                                                  bool observe_broadcast_ack)
{
    if (!data || size < sizeof(::chat::meshtastic::PacketHeaderWire))
    {
        return false;
    }

    auto* header = reinterpret_cast<::chat::meshtastic::PacketHeaderWire*>(data);
    logMeshtasticRx("[gat562][mt] tx from=%08lX to=%08lX id=%lu flags=0x%02X ch=%u next=%u relay=%u len=%u\n",
                    static_cast<unsigned long>(header->from),
                    static_cast<unsigned long>(header->to),
                    static_cast<unsigned long>(header->id),
                    static_cast<unsigned>(header->flags),
                    static_cast<unsigned>(header->channel),
                    static_cast<unsigned>(header->next_hop),
                    static_cast<unsigned>(header->relay_node),
                    static_cast<unsigned>(size));
    char wire_hex[768] = {};
    toHexString(data, size, wire_hex, sizeof(wire_hex), size);
    if (wire_hex[0] != '\0')
    {
        logMeshtasticRx("[gat562][mt] tx hex %s\n", wire_hex);
    }
    if (!transmitWire(data, size))
    {
        return false;
    }

