manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    rememberLocalPacket(*header);
    if (decoded)
    {
        queueMqttProxyPublishFromWire(data, size, decoded, channel);
    }

    const bool is_unicast = header->to != kBroadcastNode;
    const bool wants_ack = (header->flags & ::chat::meshtastic::PACKET_FLAGS_WANT_ACK_MASK) != 0;
    if (local_origin && !is_unicast && !observe_broadcast_ack)
    {
        // Broadcast messages do not receive air ACKs, but the phone app still
        // expects a successful routing result to transition the local message
        // from "queued" to "sent".
        emitRoutingResult(header->id,
                          meshtastic_Routing_Error_NONE,
                          header->from,
                          header->to,
                          channel,
                          header->channel,
                          nullptr);
    }
    if (track_retransmit &&
        ((is_unicast && (header->next_hop != 0 || wants_ack)) ||
         (local_origin && !is_unicast && observe_broadcast_ack)))
    {
        queuePendingRetransmit(*header, data, size, channel, local_origin, retries_override, !is_unicast);
    }
    return true;
}

bool MeshtasticRadioAdapter::buildAndQueueNodeInfo(::chat::NodeId dest, bool want_response,
                                                   ::chat::ChannelId channel)
{
    auto mac = readMac();
    if (identity_provider_)
    {
        ::chat::runtime::SelfIdentityInput input{};
        if (identity_provider_->readSelfIdentityInput(&input) && input.mac_addr && input.mac_addr_len >= mac.size())
        {
            std::memcpy(mac.data(), input.mac_addr, mac.size());
        }
    }

    ::chat::runtime::MeshtasticAnnouncementRequest request{};
    request.identity = buildEffectiveIdentity();
    request.mesh_config = config_;
    request.channel = channel;
    request.packet_id = next_packet_id_++;
    request.dest_node = dest;
    request.hop_limit = config_.hop_limit;
    request.want_response = want_response;
    request.mac_addr = mac.data();
    if (pki_ready_)
    {
        request.public_key = pki_public_key_.data();
        request.public_key_len = pki_public_key_.size();
    }

    ::chat::runtime::MeshtasticAnnouncementPacket packet{};
    if (!::chat::runtime::MeshtasticSelfAnnouncementCore::buildNodeInfoPacket(request, &packet))
    {
        return false;
    }
    const bool ok = transmitWire(packet.wire, packet.wire_size);
    if (ok && dest == kBroadcastNode)
    {
        last_nodeinfo_ms_ = millis();
    }
    return ok;
}

bool MeshtasticRadioAdapter::buildAndQueueRoutingPacket(::chat::NodeId dest, uint32_t request_id,
                                                        uint8_t channel_hash, ::chat::ChannelId channel,
                                                        meshtastic_Routing_Error reason,
                                                        const uint8_t* key, size_t key_len,
                                                        uint8_t hop_limit)
{
    meshtastic_Routing routing = meshtastic_Routing_init_default;
    routing.which_variant = meshtastic_Routing_error_reason_tag;
    routing.error_reason = reason;

    uint8_t routing_buf[64] = {};
    pb_ostream_t rstream = pb_ostream_from_buffer(routing_buf, sizeof(routing_buf));
    if (!pb_encode(&rstream, meshtastic_Routing_fields, &routing))
    {
        return false;
    }

    meshtastic_Data data = meshtastic_Data_init_default;
    data.portnum = meshtastic_PortNum_ROUTING_APP;
    data.want_response = false;
    data.dest = dest;
    data.source = node_id_;
    data.request_id = request_id;
    data.has_bitfield = true;
    data.bitfield = 0;
    data.payload.size = static_cast<pb_size_t>(rstream.bytes_written);
    std::memcpy(data.payload.bytes, routing_buf, data.payload.size);

    uint8_t data_buf[128] = {};
    pb_ostream_t dstream = pb_ostream_from_buffer(data_buf, sizeof(data_buf));
    if (!pb_encode(&dstream, meshtastic_Data_fields, &data))
    {
        return false;
    }

    uint8_t payload_buf[256] = {};
    const uint8_t* wire_payload = data_buf;
    size_t wire_payload_len = dstream.bytes_written;
    if (channel_hash == 0)
    {
        size_t pki_len = sizeof(payload_buf);
        const ::chat::MessageId packet_id = next_packet_id_;
        if (!encryptPkiPayload(dest, packet_id, data_buf, dstream.bytes_written, payload_buf, &pki_len))
        {
            return false;
        }
        wire_payload = payload_buf;
        wire_payload_len = pki_len;
        key = nullptr;
        key_len = 0;
    }

    uint8_t wire[256] = {};
    size_t wire_size = sizeof(wire);
    if (!::chat::meshtastic::buildWirePacket(wire_payload, wire_payload_len,
                                             node_id_, next_packet_id_++,
                                             dest, channel_hash, hop_limit, false,
                                             key, key_len, wire, &wire_size))
    {
        return false;
    }

    return transmitPreparedWire(wire, wire_size, channel, &data, false, true);
}

void MeshtasticRadioAdapter::maybeBroadcastNodeInfo(uint32_t now_ms)
{
    if (!config_.tx_enabled)
    {
        return;
    }
    if (last_nodeinfo_ms_ != 0 && (now_ms - last_nodeinfo_ms_) < kNodeInfoIntervalMs)
    {
        return;
    }
    (void)buildAndQueueNodeInfo(kBroadcastNode, false, ::chat::ChannelId::PRIMARY);
}

void MeshtasticRadioAdapter::maybeBroadcastNodeInfoAfterPeerAnnouncement(::chat::NodeId from_node,
                                                                         uint32_t now_ms,
                                                                         ::chat::ChannelId channel,
                                                                         bool from_mqtt)
{
    const auto policy = ::chat::runtime::resolveMeshtasticNodeInfoReannouncePolicy(
        isReady(),
        config_.tx_enabled,
        from_mqtt,
        from_node,
        node_id_,
        now_ms,
        last_nodeinfo_ms_);
    if (!policy.should_announce)
    {
        if (policy.reason == ::chat::runtime::MeshtasticNodeInfoReannounceReason::Suppressed)
        {
            logMeshtasticRx("[gat562][mt] nodeinfo announce suppressed from=%08lX age=%lu\n",
                            static_cast<unsigned long>(from_node),
                            static_cast<unsigned long>(policy.age_ms));
        }
        return;
    }

    if (buildAndQueueNodeInfo(kBroadcastNode, false, channel))
    {
        logMeshtasticRx("[gat562][mt] nodeinfo announce after peer from=%08lX ch=%u\n",
                        static_cast<unsigned long>(from_node),
                        static_cast<unsigned>(channel));
    }
    else
    {
        logMeshtasticRx("[gat562][mt] nodeinfo announce fail after peer from=%08lX ch=%u\n",
                        static_cast<unsigned long>(from_node),
                        static_cast<unsigned>(channel));
    }
}

bool MeshtasticRadioAdapter::sendRoutingAck(::chat::NodeId dest, uint32_t request_id, uint8_t channel_hash,
                                            ::chat::ChannelId channel, const uint8_t* key, size_t key_len,
                                            uint8_t hop_limit)
{
    return buildAndQueueRoutingPacket(dest, request_id, channel_hash, channel,
                                      meshtastic_Routing_Error_NONE, key, key_len, hop_limit);
}

bool MeshtasticRadioAdapter::sendRoutingError(::chat::NodeId dest, uint32_t request_id, uint8_t channel_hash,
                                              ::chat::ChannelId channel, const uint8_t* key, size_t key_len,
                                              meshtastic_Routing_Error reason, uint8_t hop_limit)
{
    return buildAndQueueRoutingPacket(dest, request_id, channel_hash, channel,
                                      reason, key, key_len, hop_limit);
}

::chat::runtime::RuntimeContext MeshtasticRadioAdapter::buildProtocolRuntimeContext() const
{
    ::chat::runtime::RuntimeContext context{};
    context.protocol = ::chat::MeshProtocol::Meshtastic;
    context.self_node = node_id_;
    context.now_ms = millis();

    const ::chat::runtime::MeshtasticPositionInput position = buildSelfPositionInput();
    context.self_position_valid = position.valid;
    context.self_latitude_deg = position.latitude_deg;
    context.self_longitude_deg = position.longitude_deg;
    context.self_has_altitude = position.has_altitude;
    context.self_altitude_m = position.altitude_m;
    context.self_has_speed = position.has_speed;
    context.self_speed_mps = position.speed_mps;
    context.self_has_course = position.has_course;
    context.self_course_deg = position.course_deg;
    context.self_satellites = position.satellites;
    context.self_position_timestamp_s = position.timestamp_s;
    return context;
}

