manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    meshtastic_Routing routing = meshtastic_Routing_init_default;
    routing.which_variant = meshtastic_Routing_error_reason_tag;
    routing.error_reason = reason;

    uint8_t routing_buf[32] = {};
    pb_ostream_t rstream = pb_ostream_from_buffer(routing_buf, sizeof(routing_buf));
    if (!pb_encode(&rstream, meshtastic_Routing_fields, &routing))
    {
        return;
    }

    ::chat::MeshIncomingData incoming{};
    incoming.portnum = meshtastic_PortNum_ROUTING_APP;
    incoming.from = from;
    incoming.to = to;
    incoming.packet_id = 0;
    incoming.request_id = request_id;
    incoming.channel = channel;
    incoming.channel_hash = channel_hash;
    incoming.hop_limit = rx_meta ? rx_meta->hop_limit : 0;
    incoming.payload.assign(routing_buf, routing_buf + rstream.bytes_written);
    if (rx_meta)
    {
        incoming.rx_meta = *rx_meta;
    }
    else
    {
        incoming.rx_meta.rx_timestamp_ms = millis();
        incoming.rx_meta.rx_timestamp_s = nowSeconds();
        incoming.rx_meta.time_source = ::chat::RxTimeSource::DeviceUtc;
        incoming.rx_meta.origin = ::chat::RxOrigin::Mesh;
        incoming.rx_meta.channel_hash = channel_hash;
    }
    data_queue_.push(std::move(incoming));
}

uint8_t MeshtasticRadioAdapter::ourRelayId() const
{
    return static_cast<uint8_t>(node_id_ & 0xFFU);
}

uint8_t MeshtasticRadioAdapter::getLearnedNextHop(::chat::NodeId dest, uint8_t relay_node) const
{
    if (!node_store_ || dest == 0 || dest == kBroadcastNode)
    {
        return 0;
    }

    const uint8_t next_hop = node_store_->getNextHop(dest);
    if (next_hop == 0 || next_hop == relay_node)
    {
        return 0;
    }
    return next_hop;
}

void MeshtasticRadioAdapter::learnNextHop(::chat::NodeId dest, uint8_t next_hop)
{
    if (!node_store_ || dest == 0 || dest == kBroadcastNode || next_hop == 0 || next_hop == ourRelayId())
    {
        return;
    }
    (void)node_store_->setNextHop(dest, next_hop, nowSeconds());
}

MeshtasticRadioAdapter::PacketHistoryEntry* MeshtasticRadioAdapter::findHistory(::chat::NodeId sender, ::chat::MessageId packet_id)
{
    auto it = std::find_if(packet_history_.begin(), packet_history_.end(),
                           [sender, packet_id](const PacketHistoryEntry& entry)
                           {
                               return entry.sender == sender && entry.packet_id == packet_id;
                           });
    return (it != packet_history_.end()) ? &(*it) : nullptr;
}

const MeshtasticRadioAdapter::PacketHistoryEntry* MeshtasticRadioAdapter::findHistory(::chat::NodeId sender, ::chat::MessageId packet_id) const
{
    auto it = std::find_if(packet_history_.begin(), packet_history_.end(),
                           [sender, packet_id](const PacketHistoryEntry& entry)
                           {
                               return entry.sender == sender && entry.packet_id == packet_id;
                           });
    return (it != packet_history_.end()) ? &(*it) : nullptr;
}

bool MeshtasticRadioAdapter::hasRelayer(const PacketHistoryEntry& entry, uint8_t relayer, bool* sole)
{
    bool found = false;
    bool other_present = false;
    for (uint8_t value : entry.relayed_by)
    {
        if (value == relayer)
        {
            found = true;
        }
        else if (value != 0)
        {
            other_present = true;
        }
    }
    if (sole)
    {
        *sole = found && !other_present;
    }
    return found;
}

MeshtasticRadioAdapter::HistoryResult MeshtasticRadioAdapter::updatePacketHistory(const ::chat::meshtastic::PacketHeaderWire& header,
                                                                                  bool allow_update)
{
    HistoryResult result{};
    if (header.id == 0)
    {
        return result;
    }

    const uint32_t now_ms = millis();
    packet_history_.erase(
        std::remove_if(packet_history_.begin(), packet_history_.end(),
                       [now_ms](const PacketHistoryEntry& entry)
                       {
                           return entry.last_rx_ms != 0 &&
                                  (now_ms - entry.last_rx_ms) > kPacketHistoryTimeoutMs;
                       }),
        packet_history_.end());

    PacketHistoryEntry* existing = findHistory(header.from, header.id);
    const uint8_t hop_limit = header.flags & ::chat::meshtastic::PACKET_FLAGS_HOP_LIMIT_MASK;
    const uint8_t relay_id = ourRelayId();

    if (existing)
    {
        result.seen_recently = true;
        result.we_were_next_hop = (existing->next_hop == relay_id);
        result.was_upgraded = hop_limit > existing->highest_hop_limit;
        if (existing->next_hop != 0 && existing->next_hop != relay_id &&
            header.next_hop == 0 && header.relay_node != 0 &&
            hasRelayer(*existing, header.relay_node) &&
            !hasRelayer(*existing, relay_id) &&
            !hasRelayer(*existing, existing->next_hop))
        {
            result.was_fallback = true;
        }
    }

    if (!allow_update)
    {
        return result;
    }

    if (!existing)
    {
        if (packet_history_.size() >= kPacketHistoryCapacity)
        {
            auto oldest = std::min_element(packet_history_.begin(), packet_history_.end(),
                                           [](const PacketHistoryEntry& lhs, const PacketHistoryEntry& rhs)
                                           {
                                               return lhs.last_rx_ms < rhs.last_rx_ms;
                                           });
            if (oldest != packet_history_.end())
            {
                packet_history_.erase(oldest);
            }
        }
        packet_history_.push_back(PacketHistoryEntry{});
        existing = &packet_history_.back();
        existing->sender = header.from;
        existing->packet_id = header.id;
    }

    existing->last_rx_ms = now_ms;
    existing->highest_hop_limit = std::max(existing->highest_hop_limit, hop_limit);
    if (existing->next_hop == 0)
    {
        existing->next_hop = header.next_hop;
    }
    if (header.relay_node != 0 && !hasRelayer(*existing, header.relay_node))
    {
        auto slot = std::find(existing->relayed_by.begin(), existing->relayed_by.end(), 0);
        if (slot != existing->relayed_by.end())
        {
            *slot = header.relay_node;
        }
        else
        {
            existing->relayed_by[0] = header.relay_node;
        }
    }
    return result;
}

void MeshtasticRadioAdapter::rememberLocalPacket(const ::chat::meshtastic::PacketHeaderWire& header)
{
    if (header.id == 0)
    {
        return;
    }

