manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
void MeshtasticRadioAdapter::maybeHandleObservedRelay(const ::chat::meshtastic::PacketHeaderWire& header)
{
    if (header.from == 0 || header.id == 0 || header.relay_node == 0)
    {
        return;
    }

    const PacketHistoryEntry* hist = findHistory(node_id_, header.id);
    if (!hist)
    {
        return;
    }

    if (hist->next_hop != 0 && hist->next_hop == header.relay_node)
    {
        learnNextHop(header.to, header.relay_node);
        (void)stopPendingRetransmit(node_id_, header.id);
    }
}

uint64_t MeshtasticRadioAdapter::pendingKey(::chat::NodeId from, ::chat::MessageId packet_id)
{
    return (static_cast<uint64_t>(from) << 32) | packet_id;
}

bool MeshtasticRadioAdapter::initPkiKeys()
{
    ::platform::nrf52::arduino_common::mesh::Nrf52SettingsLocalIdentityStore store;
    ::mesh::LocalIdentity stored_identity{};
    auto loaded = store.load(stored_identity);
    bool have_keys = loaded.ok &&
                     !isZeroKey(stored_identity.private_key,
                                sizeof(stored_identity.private_key));
    if (have_keys)
    {
        std::memcpy(pki_public_key_.data(), stored_identity.public_key, pki_public_key_.size());
        std::memcpy(pki_private_key_.data(), stored_identity.private_key, pki_private_key_.size());
    }

    if (!have_keys)
    {
        RNG.begin("trail-mate");
        auto mac = readMac();
        RNG.stir(mac.data(), mac.size());
        uint32_t noise = random();
        RNG.stir(reinterpret_cast<const uint8_t*>(&noise), sizeof(noise));
        Curve25519::dh1(pki_public_key_.data(), pki_private_key_.data());
        have_keys = !isZeroKey(pki_private_key_.data(), pki_private_key_.size());
        if (have_keys)
        {
            ::mesh::LocalIdentity generated{};
            std::memcpy(generated.public_key, pki_public_key_.data(), sizeof(generated.public_key));
            std::memcpy(generated.private_key, pki_private_key_.data(), sizeof(generated.private_key));
            generated.valid = true;
            (void)store.save(generated);
        }
    }

    return have_keys;
}

void MeshtasticRadioAdapter::loadPkiNodeKeys()
{
    ::platform::nrf52::arduino_common::mesh::Nrf52SettingsPeerKeyStore store;
    std::vector<::mesh::PeerPublicKey> keys;
    auto loaded = store.loadAll(keys);
    if (!loaded.ok)
    {
        if (loaded.failure != ::mesh::StoreFailure::NotFound)
        {
            logMeshtasticRx("[gat562][mt] pki key load failed status=%u\n",
                            static_cast<unsigned>(loaded.failure));
        }
        return;
    }

    node_public_keys_.clear();
    node_key_last_seen_.clear();
    for (const auto& peer_key : keys)
    {
        std::array<uint8_t, 32> key{};
        std::memcpy(key.data(), peer_key.public_key, key.size());
        node_public_keys_[peer_key.node_id.value] = key;
        node_key_last_seen_[peer_key.node_id.value] = peer_key.updated_at_ms;
    }
}

void MeshtasticRadioAdapter::savePkiNodeKey(::chat::NodeId node_id,
                                            const uint8_t* key,
                                            size_t key_len)
{
    if (node_id == 0)
    {
        return;
    }

    if (!key || key_len != 32)
    {
        logMeshtasticRx("[gat562][mt] ignore invalid pki key node=%08lX len=%u\n",
                        static_cast<unsigned long>(node_id),
                        static_cast<unsigned>(key_len));
        return;
    }

    std::array<uint8_t, 32> key_copy{};
    std::memcpy(key_copy.data(), key, key_copy.size());

    auto it = node_public_keys_.find(node_id);
    const bool existed = (it != node_public_keys_.end());
    const bool changed = !existed || (it->second != key_copy);

    if (changed)
    {
        node_public_keys_[node_id] = key_copy;
        markPkiKeysDirty();

        logMeshtasticRx("[gat562][mt] pki key updated node=%08lX\n",
                        static_cast<unsigned long>(node_id));
    }

    // 鏃犺 key 鏄惁鍙樺寲锛岄兘鍒锋柊鏈€杩戠湅鍒拌鑺傜偣鍏挜鐨勬椂闂?    touchPkiNodeKey(node_id);
}

void MeshtasticRadioAdapter::markPkiKeysDirty()
{
    pki_node_keys_dirty_ = true;
    pki_node_keys_save_due_ms_ = millis() + kPkiNodeSaveDebounceMs;
}

void MeshtasticRadioAdapter::forgetNodePublicKey(::chat::NodeId node_id)
{
    if (node_id == 0)
    {
        return;
    }

    node_public_keys_.erase(node_id);
    node_key_last_seen_.erase(node_id);
    node_last_channel_.erase(node_id);
    nodeinfo_reply_ms_.erase(node_id);
    markPkiKeysDirty();
}

bool MeshtasticRadioAdapter::savePkiKeysToPrefs()
{
    std::vector<::mesh::PeerPublicKey> entries;
    entries.reserve(node_public_keys_.size());
    for (const auto& item : node_public_keys_)
    {
        ::mesh::PeerPublicKey entry{};
        entry.node_id = ::mesh::NodeId{item.first};
        auto seen_it = node_key_last_seen_.find(item.first);
        entry.updated_at_ms = (seen_it != node_key_last_seen_.end()) ? seen_it->second : 0;
        entry.verified = false;
        std::memcpy(entry.public_key, item.second.data(), sizeof(entry.public_key));
        entries.push_back(entry);
    }

    if (entries.size() > kMaxPkiNodes)
    {
        std::sort(entries.begin(), entries.end(),
                  [](const ::mesh::PeerPublicKey& a, const ::mesh::PeerPublicKey& b)
                  {
                      return a.updated_at_ms < b.updated_at_ms;
                  });
        const size_t drop = entries.size() - kMaxPkiNodes;
        for (size_t i = 0; i < drop; ++i)
        {
            node_public_keys_.erase(entries[i].node_id.value);
            node_key_last_seen_.erase(entries[i].node_id.value);
        }
        entries.erase(entries.begin(), entries.begin() + static_cast<long>(drop));
    }

    ::platform::nrf52::arduino_common::mesh::Nrf52SettingsPeerKeyStore store;
    auto saved = store.replaceAll(entries.empty() ? nullptr : entries.data(), entries.size());
    if (saved.ok)
    {
        pki_node_keys_dirty_ = false;
    }
    return saved.ok;
}

void MeshtasticRadioAdapter::touchPkiNodeKey(::chat::NodeId node_id)
{
    node_key_last_seen_[node_id] = nowSeconds();
}

