manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
bool MeshtasticRadioAdapter::decryptPkiPayload(::chat::NodeId from, ::chat::MessageId packet_id,
                                               const uint8_t* cipher, size_t cipher_len,
                                               uint8_t* out_plain, size_t* out_plain_len)
{
    if (!cipher || cipher_len <= 12 || !out_plain || !out_plain_len || !pki_ready_)
    {
        return false;
    }

    auto it = node_public_keys_.find(from);
    if (it == node_public_keys_.end())
    {
        (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyMissing,
                               from,
                               packet_id,
                               ::chat::ChannelId::PRIMARY);
        return false;
    }

    touchPkiNodeKey(from);
    uint8_t shared[32] = {};
    uint8_t local_priv[32] = {};
    std::memcpy(shared, it->second.data(), sizeof(shared));
    std::memcpy(local_priv, pki_private_key_.data(), sizeof(local_priv));
    if (!Curve25519::dh2(shared, local_priv))
    {
        (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyStale,
                               from,
                               packet_id,
                               ::chat::ChannelId::PRIMARY);
        return false;
    }
    hashSharedKey(shared, sizeof(shared));

    const uint8_t* auth = cipher + (cipher_len - 12);
    uint32_t extra_nonce = 0;
    std::memcpy(&extra_nonce, auth + 8, sizeof(extra_nonce));

    uint8_t nonce[::chat::meshtastic::kPkiNonceSize] = {};
    initPkiNonce(from, static_cast<uint64_t>(packet_id), extra_nonce, nonce);

    const size_t plain_len = cipher_len - 12;
    if (*out_plain_len < plain_len)
    {
        *out_plain_len = plain_len;
        return false;
    }
    if (!::chat::meshtastic::decryptPkiAesCcm(shared, sizeof(shared), nonce, 8,
                                              cipher, plain_len, nullptr, 0, auth, out_plain))
    {
        (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyStale,
                               from,
                               packet_id,
                               ::chat::ChannelId::PRIMARY);
        return false;
    }

    *out_plain_len = plain_len;
    return true;
}

bool MeshtasticRadioAdapter::encryptPkiPayload(::chat::NodeId dest, ::chat::MessageId packet_id,
                                               const uint8_t* plain, size_t plain_len,
                                               uint8_t* out_cipher, size_t* out_cipher_len)
{
    if (!plain || !out_cipher || !out_cipher_len || !pki_ready_)
    {
        return false;
    }

    auto it = node_public_keys_.find(dest);
    if (it == node_public_keys_.end())
    {
        return false;
    }

    touchPkiNodeKey(dest);
    uint8_t shared[32] = {};
    uint8_t local_priv[32] = {};
    std::memcpy(shared, it->second.data(), sizeof(shared));
    std::memcpy(local_priv, pki_private_key_.data(), sizeof(local_priv));
    if (!Curve25519::dh2(shared, local_priv))
    {
        return false;
    }
    hashSharedKey(shared, sizeof(shared));

    const uint32_t extra_nonce = static_cast<uint32_t>(random());
    uint8_t nonce[::chat::meshtastic::kPkiNonceSize] = {};
    initPkiNonce(node_id_, static_cast<uint64_t>(packet_id), extra_nonce, nonce);

    const size_t needed = plain_len + 8 + sizeof(extra_nonce);
    if (*out_cipher_len < needed)
    {
        *out_cipher_len = needed;
        return false;
    }

    uint8_t auth[16] = {};
    if (!::chat::meshtastic::encryptPkiAesCcm(shared, sizeof(shared), nonce, 8,
                                              nullptr, 0,
                                              plain, plain_len,
                                              out_cipher, auth))
    {
        return false;
    }

    std::memcpy(out_cipher + plain_len, auth, 8);
    std::memcpy(out_cipher + plain_len + 8, &extra_nonce, sizeof(extra_nonce));
    *out_cipher_len = needed;
    return true;
}

void MeshtasticRadioAdapter::updateKeyVerificationState()
{
    if (kv_state_ == KeyVerificationState::Idle)
    {
        return;
    }
    const uint32_t now_ms = millis();
    if (kv_nonce_ms_ != 0 && (now_ms - kv_nonce_ms_) > kKeyVerificationTimeoutMs)
    {
        resetKeyVerificationState();
        return;
    }
    kv_nonce_ms_ = now_ms;
}

void MeshtasticRadioAdapter::resetKeyVerificationState()
{
    kv_state_ = KeyVerificationState::Idle;
    kv_nonce_ = 0;
    kv_nonce_ms_ = 0;
    kv_security_number_ = 0;
    kv_remote_node_ = 0;
    kv_hash1_.fill(0);
    kv_hash2_.fill(0);
}

void MeshtasticRadioAdapter::buildVerificationCode(char* out, size_t out_len) const
{
    if (!out || out_len < 10)
    {
        if (out && out_len > 0)
        {
            out[0] = '\0';
        }
        return;
    }
    for (int i = 0; i < 4; ++i)
    {
        out[i] = static_cast<char>((kv_hash1_[i] >> 2) + '0');
        out[i + 5] = static_cast<char>((kv_hash1_[i + 4] >> 2) + '0');
    }
    out[4] = ' ';
    out[9] = '\0';
}

bool MeshtasticRadioAdapter::handleKeyVerificationInit(const ::chat::meshtastic::PacketHeaderWire& header,
                                                       const meshtastic_KeyVerification& kv)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::Idle || header.to != node_id_ || header.to == kBroadcastNode || !pki_ready_)
    {
        return false;
    }
    auto key_it = node_public_keys_.find(header.from);
    if (key_it == node_public_keys_.end())
    {
        return false;
    }

    kv_nonce_ = kv.nonce;
    kv_nonce_ms_ = millis();
    kv_remote_node_ = header.from;
    kv_security_number_ = static_cast<uint32_t>(random(1, 1000000));
    if (!computeKeyVerificationHashes(kv_security_number_,
                                      kv_nonce_,
                                      kv_remote_node_,
                                      node_id_,
                                      key_it->second.data(),
                                      key_it->second.size(),
                                      pki_public_key_.data(),
                                      pki_public_key_.size(),
                                      kv_hash1_.data(),
                                      kv_hash2_.data()))
    {
        resetKeyVerificationState();
        return false;
    }

    meshtastic_KeyVerification reply = meshtastic_KeyVerification_init_zero;
    reply.nonce = kv_nonce_;
    reply.hash2.size = static_cast<pb_size_t>(kv_hash2_.size());
    std::memcpy(reply.hash2.bytes, kv_hash2_.data(), kv_hash2_.size());
    if (!sendKeyVerificationPacket(kv_remote_node_, reply, false))
    {
        resetKeyVerificationState();
        return false;
    }

