manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    kv_state_ = KeyVerificationState::ReceiverAwaitingHash1;
    sys::EventBus::publish(new sys::KeyVerificationNumberInformEvent(kv_remote_node_, kv_nonce_, kv_security_number_), 0);
    return true;
}

bool MeshtasticRadioAdapter::handleKeyVerificationReply(const ::chat::meshtastic::PacketHeaderWire& header,
                                                        const meshtastic_KeyVerification& kv)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::SenderInitiated ||
        header.to != node_id_ || header.to == kBroadcastNode ||
        kv.nonce != kv_nonce_ || header.from != kv_remote_node_ ||
        kv.hash1.size != 0 || kv.hash2.size != 32)
    {
        return false;
    }

    std::memcpy(kv_hash2_.data(), kv.hash2.bytes, kv_hash2_.size());
    kv_state_ = KeyVerificationState::SenderAwaitingNumber;
    kv_nonce_ms_ = millis();
    sys::EventBus::publish(new sys::KeyVerificationNumberRequestEvent(kv_remote_node_, kv_nonce_), 0);
    return true;
}

bool MeshtasticRadioAdapter::processKeyVerificationNumber(::chat::NodeId remote_node, uint64_t nonce, uint32_t number)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::SenderAwaitingNumber ||
        kv_remote_node_ != remote_node || kv_nonce_ != nonce)
    {
        return false;
    }

    auto key_it = node_public_keys_.find(remote_node);
    if (key_it == node_public_keys_.end())
    {
        resetKeyVerificationState();
        return false;
    }

    std::array<uint8_t, 32> scratch_hash{};
    kv_security_number_ = number;
    if (!computeKeyVerificationHashes(kv_security_number_,
                                      kv_nonce_,
                                      node_id_,
                                      kv_remote_node_,
                                      pki_public_key_.data(),
                                      pki_public_key_.size(),
                                      key_it->second.data(),
                                      key_it->second.size(),
                                      kv_hash1_.data(),
                                      scratch_hash.data()))
    {
        return false;
    }
    if (std::memcmp(scratch_hash.data(), kv_hash2_.data(), kv_hash2_.size()) != 0)
    {
        return false;
    }

    meshtastic_KeyVerification response = meshtastic_KeyVerification_init_zero;
    response.nonce = kv_nonce_;
    response.hash1.size = static_cast<pb_size_t>(kv_hash1_.size());
    std::memcpy(response.hash1.bytes, kv_hash1_.data(), kv_hash1_.size());
    if (!sendKeyVerificationPacket(kv_remote_node_, response, true))
    {
        return false;
    }

    kv_state_ = KeyVerificationState::SenderAwaitingUser;
    kv_nonce_ms_ = millis();
    char code[12] = {};
    buildVerificationCode(code, sizeof(code));
    sys::EventBus::publish(new sys::KeyVerificationFinalEvent(kv_remote_node_, kv_nonce_, true, code), 0);
    return true;
}

bool MeshtasticRadioAdapter::handleKeyVerificationFinal(const ::chat::meshtastic::PacketHeaderWire& header,
                                                        const meshtastic_KeyVerification& kv)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::ReceiverAwaitingHash1 ||
        header.to != node_id_ || header.to == kBroadcastNode ||
        kv.nonce != kv_nonce_ || header.from != kv_remote_node_ ||
        kv.hash1.size != 32 || kv.hash2.size != 0)
    {
        return false;
    }
    if (std::memcmp(kv.hash1.bytes, kv_hash1_.data(), kv_hash1_.size()) != 0)
    {
        return false;
    }

    kv_state_ = KeyVerificationState::ReceiverAwaitingUser;
    kv_nonce_ms_ = millis();
    char code[12] = {};
    buildVerificationCode(code, sizeof(code));
    sys::EventBus::publish(new sys::KeyVerificationFinalEvent(kv_remote_node_, kv_nonce_, false, code), 0);
    return true;
}

bool MeshtasticRadioAdapter::sendKeyVerificationPacket(::chat::NodeId dest, const meshtastic_KeyVerification& kv,
                                                       bool want_response)
{
    if (!pki_ready_ || !hasPkiKey(dest))
    {
        return false;
    }

    uint8_t kv_buf[96] = {};
    pb_ostream_t kv_stream = pb_ostream_from_buffer(kv_buf, sizeof(kv_buf));
    if (!pb_encode(&kv_stream, meshtastic_KeyVerification_fields, &kv))
    {
        return false;
    }

    uint8_t data_buf[160] = {};
    size_t data_size = sizeof(data_buf);
    if (!::chat::meshtastic::encodeAppData(meshtastic_PortNum_KEY_VERIFICATION_APP,
                                           kv_buf,
                                           kv_stream.bytes_written,
                                           want_response,
                                           data_buf,
                                           &data_size))
    {
        return false;
    }

    uint8_t pki_buf[256] = {};
    size_t pki_len = sizeof(pki_buf);
    const ::chat::MessageId packet_id = next_packet_id_++;
    if (!encryptPkiPayload(dest, packet_id, data_buf, data_size, pki_buf, &pki_len))
    {
        return false;
    }

    uint8_t wire[384] = {};
    size_t wire_size = sizeof(wire);
    if (!::chat::meshtastic::buildWirePacket(pki_buf, pki_len,
                                             node_id_, packet_id,
                                             dest, 0, config_.hop_limit, false,
                                             nullptr, 0, wire, &wire_size))
    {
        return false;
    }

    return transmitPreparedWire(wire, wire_size, ::chat::ChannelId::PRIMARY, nullptr, false, true);
}

std::string MeshtasticRadioAdapter::mqttNodeIdString() const
{
    char node_id[16];
    snprintf(node_id, sizeof(node_id), "!%08lx", static_cast<unsigned long>(node_id_));
    return std::string(node_id);
}

const char* MeshtasticRadioAdapter::mqttChannelIdFor(::chat::ChannelId channel) const
{
    if (channel == ::chat::ChannelId::SECONDARY && !mqtt_proxy_settings_.secondary_channel_id.empty())
    {
        return mqtt_proxy_settings_.secondary_channel_id.c_str();
    }
    if (!mqtt_proxy_settings_.primary_channel_id.empty())
    {
        return mqtt_proxy_settings_.primary_channel_id.c_str();
    }
    return nullptr;
}

bool MeshtasticRadioAdapter::hasAnyMqttDownlinkEnabled() const
{
    return mqtt_proxy_settings_.primary_downlink_enabled ||
           mqtt_proxy_settings_.secondary_downlink_enabled;
}

bool MeshtasticRadioAdapter::shouldPublishToMqtt(::chat::ChannelId channel, bool from_mqtt, bool is_pki) const
{
    if (!mqtt_proxy_settings_.enabled || !mqtt_proxy_settings_.proxy_to_client_enabled || from_mqtt)
    {
        return false;
    }
    if (is_pki)
    {
        return true;
    }
    if (channel == ::chat::ChannelId::SECONDARY)
    {
        return mqtt_proxy_settings_.secondary_uplink_enabled;
    }
    return mqtt_proxy_settings_.primary_uplink_enabled;
}

uint8_t MeshtasticRadioAdapter::mqttChannelHashForId(const char* channel_id, bool* out_known,
                                                     ::chat::ChannelId* out_channel) const
{
    bool known = false;
    ::chat::ChannelId channel = ::chat::ChannelId::PRIMARY;
    size_t key_len = 0;
    const uint8_t* key = nullptr;
    uint8_t hash = 0;

    if (channel_id && std::strcmp(channel_id, "PKI") == 0)
    {
        known = hasAnyMqttDownlinkEnabled();
        hash = 0;
    }
    else if (channel_id && !mqtt_proxy_settings_.primary_channel_id.empty() &&
             std::strcmp(channel_id, mqtt_proxy_settings_.primary_channel_id.c_str()) == 0)
    {
        known = mqtt_proxy_settings_.primary_downlink_enabled;
        key = selectKey(config_, ::chat::ChannelId::PRIMARY, &key_len);
        hash = ::chat::meshtastic::computeChannelHash(
            channelNameFor(config_, ::chat::ChannelId::PRIMARY),
            key,
            key_len);
    }
    else if (channel_id && !mqtt_proxy_settings_.secondary_channel_id.empty() &&
             std::strcmp(channel_id, mqtt_proxy_settings_.secondary_channel_id.c_str()) == 0)
    {
        known = mqtt_proxy_settings_.secondary_downlink_enabled;
        channel = ::chat::ChannelId::SECONDARY;
        key = selectKey(config_, ::chat::ChannelId::SECONDARY, &key_len);
        hash = ::chat::meshtastic::computeChannelHash(
            channelNameFor(config_, ::chat::ChannelId::SECONDARY),
            key,
            key_len);
    }

