manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    if (out_known)
    {
        *out_known = known;
    }
    if (out_channel)
    {
        *out_channel = channel;
    }
    return hash;
}

bool MeshtasticRadioAdapter::decodeMqttServiceEnvelope(const uint8_t* payload, size_t payload_len,
                                                       meshtastic_MeshPacket* out_packet,
                                                       char* out_channel_id, size_t channel_id_len,
                                                       char* out_gateway_id, size_t gateway_id_len) const
{
    if (!payload || payload_len == 0 || !out_packet || !out_channel_id || !out_gateway_id ||
        channel_id_len == 0 || gateway_id_len == 0)
    {
        return false;
    }

    *out_packet = meshtastic_MeshPacket_init_zero;
    out_channel_id[0] = '\0';
    out_gateway_id[0] = '\0';

    pb_istream_t stream = pb_istream_from_buffer(payload, payload_len);
    while (stream.bytes_left > 0)
    {
        pb_wire_type_t wire_type = PB_WT_VARINT;
        uint32_t tag = 0;
        bool eof = false;
        if (!pb_decode_tag(&stream, &wire_type, &tag, &eof))
        {
            return false;
        }
        if (eof)
        {
            break;
        }

        if (tag == meshtastic_ServiceEnvelope_packet_tag)
        {
            if (wire_type != PB_WT_STRING)
            {
                return false;
            }
            pb_istream_t substream;
            if (!pb_make_string_substream(&stream, &substream))
            {
                return false;
            }
            bool ok = pb_decode(&substream, meshtastic_MeshPacket_fields, out_packet);
            pb_close_string_substream(&stream, &substream);
            if (!ok)
            {
                return false;
            }
        }
        else if (tag == meshtastic_ServiceEnvelope_channel_id_tag)
        {
            if (wire_type != PB_WT_STRING)
            {
                return false;
            }
            pb_istream_t substream;
            if (!pb_make_string_substream(&stream, &substream))
            {
                return false;
            }
            bool ok = readPbString(&substream, out_channel_id, channel_id_len);
            pb_close_string_substream(&stream, &substream);
            if (!ok)
            {
                return false;
            }
        }
        else if (tag == meshtastic_ServiceEnvelope_gateway_id_tag)
        {
            if (wire_type != PB_WT_STRING)
            {
                return false;
            }
            pb_istream_t substream;
            if (!pb_make_string_substream(&stream, &substream))
            {
                return false;
            }
            bool ok = readPbString(&substream, out_gateway_id, gateway_id_len);
            pb_close_string_substream(&stream, &substream);
            if (!ok)
            {
                return false;
            }
        }
        else if (!pb_skip_field(&stream, wire_type))
        {
            return false;
        }
    }

    return out_packet->which_payload_variant == meshtastic_MeshPacket_decoded_tag ||
           out_packet->which_payload_variant == meshtastic_MeshPacket_encrypted_tag;
}

bool MeshtasticRadioAdapter::injectMqttEnvelope(const meshtastic_MeshPacket& packet,
                                                const char* channel_id,
                                                const char* gateway_id)
{
    (void)gateway_id;

    if (!mqtt_proxy_settings_.enabled || !mqtt_proxy_settings_.proxy_to_client_enabled)
    {
        return false;
    }

    bool known_channel = false;
    ::chat::ChannelId channel_index = ::chat::ChannelId::PRIMARY;
    const uint8_t channel_hash = mqttChannelHashForId(channel_id, &known_channel, &channel_index);
    if (!known_channel)
    {
        return false;
    }

    if (packet.which_payload_variant == meshtastic_MeshPacket_decoded_tag)
    {
        if (mqtt_proxy_settings_.encryption_enabled)
        {
            return false;
        }
        if (packet.decoded.portnum == meshtastic_PortNum_ADMIN_APP)
        {
            return false;
        }
    }

    auto& scratch = mqtt_scratch_;
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);
    uint8_t* wire_buffer = scratch.wire.data();
    size_t wire_size = sizeof(::chat::meshtastic::PacketHeaderWire);

    if (packet.which_payload_variant == meshtastic_MeshPacket_encrypted_tag)
    {
        ::chat::meshtastic::PacketHeaderWire header{};
        header.to = packet.to;
        header.from = packet.from;
        header.id = packet.id;
        header.flags = (packet.hop_limit & ::chat::meshtastic::PACKET_FLAGS_HOP_LIMIT_MASK) |
                       ((packet.hop_start << ::chat::meshtastic::PACKET_FLAGS_HOP_START_SHIFT) &
                        ::chat::meshtastic::PACKET_FLAGS_HOP_START_MASK) |
                       ::chat::meshtastic::PACKET_FLAGS_VIA_MQTT_MASK;
        if (packet.want_ack)
        {
            header.flags |= ::chat::meshtastic::PACKET_FLAGS_WANT_ACK_MASK;
        }
        header.channel = packet.channel != 0 ? packet.channel : channel_hash;
        header.next_hop = packet.next_hop;
        header.relay_node = packet.relay_node;
        std::memcpy(wire_buffer, &header, sizeof(header));

        const size_t enc_size =
            std::min(static_cast<size_t>(packet.encrypted.size), sizeof(packet.encrypted.bytes));
        if (wire_size + enc_size > scratch.wire.size())
        {
            return false;
        }
        std::memcpy(wire_buffer + wire_size, packet.encrypted.bytes, enc_size);
        wire_size += enc_size;
    }
    else
    {
        std::memset(&scratch.decoded, 0, sizeof(scratch.decoded));
        scratch.decoded = packet.decoded;
        meshtastic_Data& decoded = scratch.decoded;
        decoded.dest = packet.to;
        decoded.source = packet.from;
        decoded.has_bitfield = true;

        std::fill(scratch.buffer.begin(), scratch.buffer.end(), 0);
        pb_ostream_t dstream = pb_ostream_from_buffer(scratch.buffer.data(), scratch.buffer.size());
        if (!pb_encode(&dstream, meshtastic_Data_fields, &decoded))
        {
            return false;
        }

        size_t psk_len = 0;
        const uint8_t* psk = selectKey(config_, channel_index, &psk_len);
        size_t rebuilt_size = scratch.wire.size();
        if (!::chat::meshtastic::buildWirePacket(scratch.buffer.data(), dstream.bytes_written,
                                                 packet.from, packet.id,
                                                 packet.to, channel_hash, packet.hop_limit, packet.want_ack,
                                                 psk, psk_len, wire_buffer, &rebuilt_size))
        {
            return false;
        }
        wire_size = rebuilt_size;
        auto* rebuilt_header = reinterpret_cast<::chat::meshtastic::PacketHeaderWire*>(wire_buffer);
        rebuilt_header->flags |= ::chat::meshtastic::PACKET_FLAGS_VIA_MQTT_MASK;
        if (packet.hop_start != 0)
        {
            rebuilt_header->flags &= ~::chat::meshtastic::PACKET_FLAGS_HOP_START_MASK;
            rebuilt_header->flags |= ((packet.hop_start << ::chat::meshtastic::PACKET_FLAGS_HOP_START_SHIFT) &
                                      ::chat::meshtastic::PACKET_FLAGS_HOP_START_MASK);
        }
        rebuilt_header->next_hop = packet.next_hop;
        rebuilt_header->relay_node = packet.relay_node;
    }

